# ManyDirectionCurvesError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ManyDirectionCurvesError Property
BuiltInFailures..::..SketchFailures Class See Also
---
More than one direction curve specified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ManyDirectionCurvesError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ManyDirectionCurvesError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ManyDirectionCurvesError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace